node {
  name: "G4SM2HGMB5"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@G4SM2HGMB5/Read/ReadVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 117
        }
        dim {
          size: 224
        }
        dim {
          size: 224
        }
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "G4SM2HGMB5"
    }
  }
}
node {
  name: "HK0SX0WHBZ"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@HK0SX0WHBZ/Read/ReadVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 117
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "HK0SX0WHBZ"
    }
  }
}
node {
  name: "bn2a_branch1/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch1_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2a_branch1/moving_mean"
    }
  }
}
node {
  name: "bn2a_branch1/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch1_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2a_branch1/moving_variance"
    }
  }
}
node {
  name: "bn2a_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2a_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn2a_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2a_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn2a_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2a_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn2a_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2a_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn2a_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2a_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn2a_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2a_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn2b_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2b_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2b_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn2b_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2b_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2b_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn2b_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2b_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2b_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn2b_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2b_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2b_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn2b_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2b_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2b_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn2b_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2b_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2b_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn2c_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2c_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2c_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn2c_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2c_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2c_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn2c_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2c_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2c_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn2c_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2c_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2c_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn2c_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2c_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2c_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn2c_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2c_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn2c_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn3a_branch1/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3a_branch1_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3a_branch1/moving_mean"
    }
  }
}
node {
  name: "bn3a_branch1/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3a_branch1_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3a_branch1/moving_variance"
    }
  }
}
node {
  name: "bn3a_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3a_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3a_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn3a_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3a_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3a_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn3a_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3a_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3a_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn3a_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3a_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3a_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn3a_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3a_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3a_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn3a_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3a_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3a_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn3b_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3b_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3b_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn3b_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3b_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3b_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn3b_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3b_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3b_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn3b_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3b_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3b_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn3b_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3b_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3b_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn3b_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3b_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3b_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn3c_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3c_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3c_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn3c_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3c_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3c_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn3c_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3c_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3c_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn3c_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3c_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3c_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn3c_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3c_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3c_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn3c_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3c_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3c_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn3d_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3d_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3d_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn3d_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3d_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3d_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn3d_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3d_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3d_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn3d_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3d_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3d_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn3d_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3d_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3d_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn3d_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn3d_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn3d_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn4a_branch1/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4a_branch1_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4a_branch1/moving_mean"
    }
  }
}
node {
  name: "bn4a_branch1/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4a_branch1_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4a_branch1/moving_variance"
    }
  }
}
node {
  name: "bn4a_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4a_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4a_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn4a_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4a_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4a_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn4a_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4a_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4a_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn4a_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4a_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4a_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn4a_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4a_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4a_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn4a_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4a_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4a_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn4b_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4b_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4b_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn4b_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4b_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4b_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn4b_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4b_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4b_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn4b_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4b_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4b_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn4b_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4b_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4b_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn4b_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4b_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4b_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn4c_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4c_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4c_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn4c_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4c_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4c_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn4c_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4c_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4c_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn4c_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4c_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4c_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn4c_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4c_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4c_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn4c_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4c_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4c_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn4d_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4d_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4d_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn4d_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4d_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4d_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn4d_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4d_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4d_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn4d_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4d_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4d_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn4d_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4d_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4d_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn4d_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4d_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4d_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn4e_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4e_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4e_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn4e_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4e_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4e_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn4e_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4e_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4e_branch2b/moving_mean"
    }
  }
}
node {
  name: "bn4e_branch2b/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4e_branch2b_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4e_branch2b/moving_variance"
    }
  }
}
node {
  name: "bn4e_branch2c/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4e_branch2c_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4e_branch2c/moving_mean"
    }
  }
}
node {
  name: "bn4e_branch2c/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4e_branch2c_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4e_branch2c/moving_variance"
    }
  }
}
node {
  name: "bn4f_branch2a/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4f_branch2a_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4f_branch2a/moving_mean"
    }
  }
}
node {
  name: "bn4f_branch2a/moving_variance"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4f_branch2a_1/AssignMovingAvg_1/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn4f_branch2a/moving_variance"
    }
  }
}
node {
  name: "bn4f_branch2b/moving_mean"
  op: "VarHandleOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn4f_branch2b_1/AssignMovingAvg/AssignSubVariableOp"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
